In [2]:
import pandas as pd

In [3]:
data = {
    'Name': [
        'Zane', 'Cathy', 'Leo', 'Mona', 'Alice', 'David', 'Grace', 'Nate', 'Ben', 'Olivia',
        'Bob', 'Victor', 'Quinn', 'Xander', 'Ella', 'Paul', 'Frank', 'Kate', 'Wendy', 'Henry',
        'Jack', 'Tina', 'Sam', 'Ivy', 'Cara', 'Rita', 'Yara', 'Dan', 'Uma', 'Abby'
    ],
    'Age': [
        42, 21, 30, 28, 22, 25, 20, 26, 44, 33,
        24, 40, 29, 41, 23, 31, 19, 30, 38, 22,
        21, 30, 34, 24, 43, 32, 39, 45, 36, 19
    ],
    'Income': [
        62500, 33000, 47000, 50000, 32000, 35000, 34000, 46000, 61500, 49000,
        31000, 63000, 52000, 60000, 30000, 51000, 29000, 47000, 61000, 36000,
        30000, 48500, 47000, 31000, 63500, 49500, 64000, 64500, 62000, 29000
    ]
}

df=pd.DataFrame(data)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    30 non-null     object
 1   Age     30 non-null     int64
 2   Income  30 non-null     int64
dtypes: int64(2), object(1)
memory usage: 848.0+ bytes

In [5]:
df.head()

    Name  Age  Income
0   Zane   42   62500
1  Cathy   21   33000
2    Leo   30   47000
3   Mona   28   50000
4  Alice   22   32000

In [6]:
df.sample()

    Name  Age  Income
17  Kate   30   47000

In [8]:
df.describe()

             Age        Income
count  30.000000     30.000000
mean   30.366667  46633.333333
std     8.223110  12887.399174
min    19.000000  29000.000000
25%    23.250000  33250.000000
50%    30.000000  47750.000000
75%    37.500000  60750.000000
max    45.000000  64500.000000

In [9]:
print(df)

      Name  Age  Income
0     Zane   42   62500
1    Cathy   21   33000
2      Leo   30   47000
3     Mona   28   50000
4    Alice   22   32000
5    David   25   35000
6    Grace   20   34000
7     Nate   26   46000
8      Ben   44   61500
9   Olivia   33   49000
10     Bob   24   31000
11  Victor   40   63000
12   Quinn   29   52000
13  Xander   41   60000
14    Ella   23   30000
15    Paul   31   51000
16   Frank   19   29000
17    Kate   30   47000
18   Wendy   38   61000
19   Henry   22   36000
20    Jack   21   30000
21    Tina   30   48500
22     Sam   34   47000
23     Ivy   24   31000
24    Cara   43   63500
25    Rita   32   49500
26    Yara   39   64000
27     Dan   45   64500
28     Uma   36   62000
29    Abby   19   29000

In [10]:
bins = [17, 25, 35, 45]
labels = ['18-25', '26-35', '36-45']
df['Age_Group'] = pd.cut(df['Age'], bins=bins, labels=labels)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       30 non-null     object
 1   Age        30 non-null     int64
 2   Income     30 non-null     int64
 3   Age_Group  30 non-null     category
dtypes: category(1), int64(2), object(1)
memory usage: 1010.0+ bytes

In [12]:
print(df)

      Name  Age  Income Age_Group
0     Zane   42   62500     36-45
1    Cathy   21   33000     18-25
2      Leo   30   47000     26-35
3     Mona   28   50000     26-35
4    Alice   22   32000     18-25
5    David   25   35000     18-25
6    Grace   20   34000     18-25
7     Nate   26   46000     26-35
8      Ben   44   61500     36-45
9   Olivia   33   49000     26-35
10     Bob   24   31000     18-25
11  Victor   40   63000     36-45
12   Quinn   29   52000     26-35
13  Xander   41   60000     36-45
14    Ella   23   30000     18-25
15    Paul   31   51000     26-35
16   Frank   19   29000     18-25
17    Kate   30   47000     26-35
18   Wendy   38   61000     36-45
19   Henry   22   36000     18-25
20    Jack   21   30000     18-25
21    Tina   30   48500     26-35
22     Sam   34   47000     26-35
23     Ivy   24   31000     18-25
24    Cara   43   63500     36-45
25    Rita   32   49500     26-35
26    Yara   39   64000     36-45
27     Dan   45   64500     36-45
28     Uma   36   62000     36-45
29    Abby   19   29000     18-25

In [13]:
grouped = df.groupby('Age_Group')['Income'].agg(['mean', 'median', 'min', 'max', 'std'])

C:\Users\piyus\AppData\Local\Temp\ipykernel_17332\3427506461.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = df.groupby('Age_Group')['Income'].agg(['mean', 'median', 'min', 'max', 'std'])

In [14]:
grouped = df.groupby('Age_Group', observed=True)['Income'].agg(['mean', 'median', 'min', 'max', 'std'])

In [15]:
print("Summary Statistics (Grouped by Age Range):")
print(grouped)

Summary Statistics (Grouped by Age Range):
                   mean   median    min    max          std
Age_Group
18-25      31818.181818  31000.0  29000  36000  2400.757456
26-35      48700.000000  48750.0  46000  52000  1960.725489
36-45      62444.444444  62500.0  60000  64500  1467.234738